app/Controllers/AuthController.php

    public function login()
    {
        $numero_telephone = $this->request->getPost('numero_telephone');

        $clientModel = new ClientModel();
        $operateurModel = new OperateurModel();

        $data = [
            'numero_telephone' => $numero_telephone,
        ];

        if (!$this->validateData($data, $clientModel->loginRules, $clientModel->loginMessages)) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        $client = $clientModel->where('numero_telephone', $numero_telephone)->first();

        $operateur = $operateurModel->where('code', $numero_telephone)->first();
---
SELECT *
FROM `clients`
WHERE `numero_telephone` = '0345259316'
 LIMIT 1
SELECT *
FROM `operateurs`
WHERE `code` = '0345259316'
 LIMIT 1