app/Controllers/EpargneController.php

    public function saveEpargne()
    {
        $epargneModel = new EpargneModel();

        $data = $this->request->getPost();
        $clientId = session()->get('client_id');

        $result = [
            'pct_epargne' => $data['pct_epargne'],
            'client_id' => $clientId,
        ];

        $epargneModel->insert($result);
---
INSERT INTO `epargnes` (`pct_epargne`, `client_id`) VALUES ('0.2', 1)