app/Controllers/OperationController.php

SELECT *
FROM `operateurs`
WHERE `operateurs`.`id` = 1
---
        }

        $prefixe = $prefixeModel->getOperateurByNumero($rawDestinations[0] ?? $numero);
        $operateur = $operateurModel->find($prefixe['operateur_id'] ?? null);