app/Controllers/OperationController.php

SELECT *
FROM `operateurs`
WHERE `operateurs`.`id` = 2
---
    public function getMontantAPayer()
    {
        $montant = $this->request->getGet('montant');
        $numero = $this->request->getGet('numero');
        $typeOperationId = $this->request->getGet('type_operation_id');
        $destinations = $this->request->getGet('destinations');

        $operateurModel = new OperateurModel();
        $clientModel = new ClientModel();
        $fraisModel = new FraisModel();

        $compteCount = 1;
        if (!empty($destinations)) {
            $rawDestinations = preg_split('/[\r\n,;]+/', trim($destinations));
            $compteCount = count(array_filter($rawDestinations, static function ($value) {
                return trim($value) !== '';
            }));
        }

        $prefix = $clientModel->isProprio($numero);
        $proprietaire = $operateurModel->find($prefix['operateur_id']);

SELECT *
FROM `operateurs`
WHERE `operateurs`.`id` = 1
---
        }

        $prefixe = $prefixeModel->getOperateurByNumero(session()->get('client_numero_telephone'));
        $operateurCible = $prefixe ? $operateurModel->find($prefixe['operateur_id']) : null;

SELECT *
FROM `operateurs`
WHERE `operateurs`.`id` = 2
---
                }

                $prefixeDestination = $prefixeModel->getOperateurByNumero($recipientNumero);
                $operateurDestination = $operateurModel->find($prefixeDestination['operateur_id']);

UPDATE `comptes` SET `solde` = 14379
WHERE `comptes`.`id` IN (1)
---
                $updatedDestinationBalance = $detail['compte_destination']['solde'] + $detail['montant'] + $detail['frais'];

                $compteModel->update($compteSource['id'], ['solde' => $updatedSourceBalance]);
                $compteModel->update($detail['compte_destination']['id'], ['solde' => $updatedDestinationBalance]);

UPDATE `operateurs` SET `gain` = 7300
WHERE `operateurs`.`id` IN (1)
INSERT INTO `operations` (`type_operation_id`, `compte_source_id`, `compte_destination_id`, `montant`, `frais`, `commission`, `date_operation`) VALUES (1, 1, 3, 903, 500, 3, '2026-07-21 05:34:21')
---

                if ($operateurCible) {
                    $operateurCible['gain'] = $operateurCible['gain'] + $detail['frais'];
                    $operateurModel->update($operateurCible['id'], ['gain' => $operateurCible['gain']]);
                }

                $operationModel->insert([
                    'type_operation_id' => $typeOperation,
                    'compte_source_id' => $compteSource['id'],
                    'compte_destination_id' => $detail['compte_destination']['id'],
                    'montant' => $detail['montant'] + $detail['frais'],
                    'frais' => $detail['frais'],
                    'commission' => $detail['commission'],
                ]);