app/Controllers/StatistiqueController.php

SELECT *
FROM `operateurs`
---
    public function gain()
    {
        $operateurModel = new OperateurModel();
        $operateurs = $operateurModel->findAll();