app/Models/ClientModel.php

SELECT `solde`
FROM `comptes`
WHERE `client_id` = '1'
---
    public function getSoldeByClientId($clientId)
    {
        $builder = $this->db->table('comptes');
        return $builder->select('solde')->where('client_id', $clientId)->get()->getRow()->solde;

SELECT *
FROM `historique_details`
WHERE `compte_source_id` = '1'
OR `compte_destination_id` = '1'
ORDER BY `date_operation` DESC
---
    public function getHistoriqueTransactions($clientId)
    {
        // dd($this->db->database);
        $builder = $this->db->table(('historique_details'));
        return $builder->where('compte_source_id', $clientId)->orWhere('compte_destination_id', $clientId)->orderBy('date_operation', 'DESC')->get()->getResult();

SELECT *
FROM `clients`
WHERE `numero_telephone` = '0330500312'
 LIMIT 1
---
    public function findByNumeroTelephone($numeroTelephone)
    {
        return $this->where('numero_telephone', $numeroTelephone)->first();