app/Models/CommissionModel.php

SELECT `commissions`.*, `operateurs`.`nom` as `operateur_nom`, `operateurs`.`code` as `operateur_code`, `operateurs`.`proprio` as `operateur_proprio`
FROM `commissions`
LEFT JOIN `operateurs` ON `commissions`.`operateur_id` = `operateurs`.`id`
---
    public function findAllDetailed()
    {
        return $this->select('commissions.*, operateurs.nom as operateur_nom, operateurs.code as operateur_code, operateurs.proprio as operateur_proprio')
                    ->join('operateurs', 'commissions.operateur_id = operateurs.id', 'left')
                    ->findAll();