app/Models/CompteModel.php

    public function getCompteByClientId($clientId)
    {
        return $this->where('client_id', $clientId)->first();
---
SELECT *
FROM `comptes`
WHERE `client_id` = 1
 LIMIT 1