app/Models/CompteModel.php

    public function findAllDetailed()
    {
        return $this->select('comptes.*, clients.nom as client_nom, clients.prenom as client_prenom, clients.numero_telephone as client_numero_telephone')
                    ->join('clients', 'comptes.client_id = clients.id', 'left')
                    ->findAll();
---
SELECT `comptes`.*, `clients`.`nom` as `client_nom`, `clients`.`prenom` as `client_prenom`, `clients`.`numero_telephone` as `client_numero_telephone`
FROM `comptes`
LEFT JOIN `clients` ON `comptes`.`client_id` = `clients`.`id`

    public function getTotalSolde()
    {
        return $this->selectSum('solde')->first();
---
SELECT SUM(`solde`) AS `solde`
FROM `comptes`
 LIMIT 1