app/Models/FraisModel.php

SELECT *
FROM `frais`
WHERE `montant_min` <= 200
AND `montant_max` >= 200
AND `type_operation_id` IS NULL
 LIMIT 1
---
    public function getFraisByMontant($montant, $typeOperationId)
    {
        return $this->where('montant_min <=', $montant)
                    ->where('montant_max >=', $montant)
                    ->where('type_operation_id', $typeOperationId)
                    ->first();