app/Models/OperateurModel.php

SELECT SUM(`gain`) AS `gain`
FROM `operateurs`
 LIMIT 1
---
    public function getGainTotal()
    {
        return $this->selectSum('gain')->first();

SELECT *
FROM `operateurs`
WHERE `operateurs`.`id` = 1
---
    public function isProprio($operateurId)
    {
        $operateur = $this->find($operateurId);

SELECT *
FROM `operateurs`
WHERE `proprio` = 1
---
    public function findAllProprio()
    {
        return $this->where('proprio', 1)->findAll();

SELECT *
FROM `commissions`
WHERE `operateur_id` = 1
---
public function getOperateurCommission($operateurId)
    {
        $commission = $this->db->table('commissions')
            ->where('operateur_id', $operateurId)
            ->get()
            ->getRow();