app/Models/OperationModel.php

    public function getTotalFraisGroupedByType()
    {
        return $this->select('types_operation.libelle as type_operation, COALESCE(SUM(operations.frais), 0) as total_frais')
                    ->join('types_operation', 'operations.type_operation_id = types_operation.id', 'left')
                    ->groupBy('types_operation.id')
                    ->findAll();
---
SELECT `types_operation`.`libelle` as `type_operation`, COALESCE(SUM(operations.frais), 0) as total_frais
FROM `operations`
LEFT JOIN `types_operation` ON `operations`.`type_operation_id` = `types_operation`.`id`
GROUP BY `types_operation`.`id`

    public function getTotalFraisGroupedByMois()
    {
        return $this->select("strftime('%m', date_operation) as mois, COALESCE(SUM(frais), 0) as total_frais")
                    ->groupBy("strftime('%m', date_operation)")
                    ->findAll();
---
SELECT strftime('%m', date_operation) as mois, COALESCE(SUM(frais), 0) as total_frais
FROM `operations`
GROUP BY strftime('%m', date_operation)