app/Models/PrefixeModel.php

SELECT *
FROM `prefixes`
WHERE `prefixe` = '034'
 LIMIT 1
---
    public function getOperateurByNumero($numero)
    {
        $prefixe = substr($numero, 0, 3);
        return $this->where('prefixe', $prefixe)->first();