app/Models/PromotionModel.php

SELECT `promotions`.*, `operateurs`.`nom` as `operateur_nom`, `operateurs`.`code` as `operateur_code`, `operateurs`.`proprio` as `operateur_proprio`
FROM `promotions`
LEFT JOIN `operateurs` ON `promotions`.`operateur_id` = `operateurs`.`id`
---
    public function findAllDetailed()
    {
        return $this->select('promotions.*, operateurs.nom as operateur_nom, operateurs.code as operateur_code, operateurs.proprio as operateur_proprio')
                    ->join('operateurs', 'promotions.operateur_id = operateurs.id', 'left')
                    ->findAll();